Configuration/Documents/ВключениеВКадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВключениеВКадровыйРезерв</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаВключениеВКадровыйРезерв</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьСтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.СтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.ИсторияКадровогоРезерва</xr:Item>
				<xr:Item>InformationRegister.УдалитьИсторияКадровогоРезерва</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВключенияВКадровыйРезерв</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
					<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчастникКадровогоРезерва</Name>
							<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСКадровымиРезервистами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусГотовности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыГотовностиРезервистов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куратор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/InformationRegisters/ИсторияКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияКадровогоРезерва</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Enums/ДействияСКадровымиРезервистами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействияСКадровымиРезервистами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оставить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Documents/ВключениеВКадровыйРезерв/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьДействующиеВключения(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.ВключениеВКадровыйРезерв.ПолучитьДанныеДляПроведения(Ссылка);
	
	КадровыйРезерв.СформироватьДвиженияИсторииКадровогоРезерва(Движения, ДанныеДляПроведения,
		"ДвиженияИсторииКадровогоРезерва");
	КадровыйРезерв.СформироватьДвиженияСтатусыГотовностиРезервистов(Движения, ДанныеДляПроведения,
		"ДвиженияСтатусыРезервистов");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.СформироватьДвиженияПоНаставничеству(Ссылка, ЭтотОбъект, Движения, ДанныеДляПроведения, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВключениеВКадровыйРезерв") Тогда
		ЗаполнитьПоЗаявке(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьПоСтруктуре(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаРассмотрения, "Объект.ДатаРассмотрения", Отказ,
		НСтр("ru='Дата рассмотрения'"));
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ВключениеВРезервПриОбработкеПроверкиЗаполнения(МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		Если СтрокаСотрудника.Действие = Перечисления.ДействияСКадровымиРезервистами.Утвердить
			И Не ЗначениеЗаполнено(СтрокаСотрудника.СтатусГотовности) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'У сотрудника %1 (строка %2) не заполнен статус готовности'"),
				СтрокаСотрудника.УчастникКадровогоРезерва,
				СтрокаСотрудника.НомерСтроки);
			
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"Сотрудники", СтрокаСотрудника.НомерСтроки, "СтатусГотовности");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКРеквизиту, "Объект", Отказ);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаРассмотрения = НачалоДня(ДатаРассмотрения) + КадровыйРезерв.ЗначениеВремениПоСтатусуРезерва(
		ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДействующиеВключения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	Сотрудники.ПозицияРезерва КАК ПозицияРезерва,
		|	Сотрудники.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	&Сотрудники КАК Сотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудники.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВТСотрудники.ПозицияРезерва КАК ПозицияРезерва,
		|	ИсторияКадровогоРезерваСрезПоследних.Период КАК ДатаВключения,
		|	ВТСотрудники.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКадровогоРезерва.СрезПоследних(&ДатаВключения,) КАК
		|			ИсторияКадровогоРезерваСрезПоследних
		|		ПО ВТСотрудники.УчастникКадровогоРезерва = ИсторияКадровогоРезерваСрезПоследних.УчастникКадровогоРезерва
		|		И ВТСотрудники.ПозицияРезерва = ИсторияКадровогоРезерваСрезПоследних.ПозицияРезерва
		|ГДЕ
		|	ИсторияКадровогоРезерваСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)
		|	И (ИсторияКадровогоРезерваСрезПоследних.ДатаОкончания >= &ДатаВключения
		|	ИЛИ ИсторияКадровогоРезерваСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И ИсторияКадровогоРезерваСрезПоследних.Регистратор <> &Ссылка";
		
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники.Выгрузить());
	Запрос.УстановитьПараметр("ДатаВключения", ДатаРассмотрения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	ШаблонТекстаОшибки = НСтр("ru = 'Сотрудник %1 уже включен в резерв на позицию ""%2"" с %3.'");
	Пока РезультатЗапроса.Следующий() Цикл
		ТекстОшибки = СтрШаблон(
			ШаблонТекстаОшибки,
			РезультатЗапроса.УчастникКадровогоРезерва,
			РезультатЗапроса.ПозицияРезерва,
			Формат(РезультатЗапроса.ДатаВключения, "ДЛФ=D"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка,
			"Объект.Сотрудники[" + Формат(РезультатЗапроса.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].УчастникКадровогоРезерва", ,
			Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявке(ДанныеЗаполнения)
	
	Заявка = ДанныеЗаполнения.ПолучитьОбъект();
	ОснованиеОбъект = Заявка.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Заявка, "Подразделение, ВидРезерва");
	НоваяСтрока = Сотрудники.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Заявка, "УчастникКадровогоРезерва, ПозицияРезерва, Наставник, Куратор");
	НоваяСтрока.Действие = Перечисления.ДействияСКадровымиРезервистами.Утвердить;
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения - Структура
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	ДанныеСотрудники = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Сотрудники");
	Если ЗначениеЗаполнено(ДанныеСотрудники) И ТипЗнч(ДанныеСотрудники) = Тип("Массив") Тогда
		Для Каждого ДанныеСотрудника Из ДанныеСотрудники Цикл
			НоваяСтрока = Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСотрудника);
			НоваяСтрока.Действие = Перечисления.ДействияСКадровымиРезервистами.Утвердить;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
